---
kind: property
id: P:Autodesk.Revit.DB.TextRange.Length
zh: 长度
source: html/cbb7ad17-5ea1-eefb-1bd3-65f19337a7eb.htm
---
# Autodesk.Revit.DB.TextRange.Length Property

**中文**: 长度

The length of the range.

## Syntax (C#)
```csharp
public int Length { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for length is negative.